[{"date":"09/30/2014","article":"iWatch","identity":"Blogger1","name":"Blogger1","comment":"It's more convenient for me to use the application on iWatch. Especially, it can connect to my iPhone for monitoring and recording.","location":{"latitude":"47.571946","longitude":"-52.734753"},"deleted":0},{"date":"09/30/2014","article":"iWatch","identity":"Blogger2","name":"Blogger2","comment":"To be honest, I am a little disappointed about Apple this time. This product seems very similar with the Samsung Galaxy Gear Watch. And I don't like the rectangular-shaped screen.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"09/30/2014","article":"iWatch","identity":"Blogger2","name":"Blogger2","comment":"According to the application's display, using the circle screen is better. Compare the appearance, Moto 360 seems the best choice than iWatch. If I want to use functional device, I still choose smart phone rather than smart watch. So, the appearance is more important, but Apple failed.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"09/30/2014","article":"iWatch","identity":"Blogger1","name":"Blogger1","comment":"When I need the navigation, I prefer to check my wrist rather then operate my iPhone and prevent it to fall down in the line. Besides, its value is more than a product, I can even regard it as a fashion decoration.","location":{"latitude":"47.571946","longitude":"-52.734753"},"deleted":0},{"date":"09/14/2014","article":"scottish","identity":"Blogger1","name":"Blogger1","comment":"I have to wonder if the yes side considered all of these side-effects of sovereignty when deciding to have a referendum?","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"09/14/2014","article":"scottish","identity":"Blogger1","name":"Blogger1","comment":"In any event, sure lots of people don't agree with having an outdated, out-of-touch monarchy in today's global environment, but there are many advantages to remaining united with the United Kingdom, one of the world's most powerful countries. These benefits, economic, military and cultural, far outweigh the benefits of secession.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"09/14/2014","article":"scottish","identity":"Blogger2","name":"Blogger2","comment":"Even if the referendum concludes that Scotland should separate, it will take at least a year for it to happen.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"09/14/2014","article":"scottish","identity":"Blogger2","name":"Blogger2","comment":"This time could be well spent arranging solutions to the problems brought up in this article. Given that Scotland is a strong, oil-rich nation, it is likely they would be able to successfully apply for membership to these organizations.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"","article":"social","identity":"Blogger2","name":"Blogger2","comment":"When used responsibly, social media is an incredible tool that never would have been possible with yesterday's technology.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"","article":"social","identity":"Blogger1","name":"Blogger1","comment":"I've been saying for years that our society's obsession with social media is dangerously blurring the lines between private life and public life.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"","article":"social","identity":"Blogger2","name":"Blogger2","comment":"It allows instant information to be spread far and quickly. Many companies use it as a tool to attract new business, and to rapidly update their information in a way that takes longer using traditional websites.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"","article":"social","identity":"Blogger1","name":"Blogger1","comment":"People don't seem to recognize the fact that everything online could potentially be viewed by just about anyone. You only have 3 Facebook friends? Well remember that these three people could potentially share your post with thousands! And besides, why do you think I want to know what you had for breakfast or to see 137 photos of your cat?","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"","article":"syria","identity":"Blogger2","name":"Blogger2","comment":"Why America always be the big brother to lead everything? Although they permit kinds of people to move into America. But their still full of racist comment.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"","article":"syria","identity":"Blogger1","name":"Blogger1","comment":"Islamic State organisation in Iraq and Syria is evil. They already murder the innocent reporter and provoke America.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"","article":"syria","identity":"Blogger2","name":"Blogger2","comment":"Above the reason accumulate a long time, such as Islamic State terrorism can't tolerate anymore and decide to vent their emotion in the worst way. We are innocent, all i hope is no more people die in the war.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"date":"","article":"syria","identity":"Blogger1","name":"Blogger1","comment":"Such terrorism should be wiped out as soon as possible. Please help us to return to peaceful world.","location":{"latitude":"47.576707","longitude":"-52.731863"},"deleted":0},{"identity":"visitor","name":"Name","comment":"I%27m+new","date":"12/02/2014","article":"iWatch","location":{"latitude":"53","longitude":"0"},"deleted":"0"},{},
{"identity":"blogger1","name":"","comment":"Comment","date":"12/02/2014","article":"scottish","location":{"latitude":"53","longitude":"0"},"deleted":"0"}]